In [1]:
import pandas as pd
import numpy as np

In [2]:
df_categoricos=pd.read_csv("categoricos.csv", index_col=0)

In [3]:
df_categoricos.head(10)

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,0,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,Yes
1,No,NaN,NaN,Life Sciences,0,ManAGeR,NaN,NaN,NaN,NaN,NaN,1
2,No,travel_rarely,Research & Development,Technical Degree,0,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,1
3,No,travel_rarely,NaN,Medical,1,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,False
4,No,NaN,NaN,Technical Degree,1,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,0
5,No,NaN,Research & Development,Medical,1,MANAger,NaN,NaN,No,NaN,MANAger - Research & Development,Yes
6,No,NaN,NaN,Life Sciences,1,Sales ExeCutIVe,NaN,Y,NaN,Part Time,NaN,True
7,No,travel_rarely,NaN,NaN,0,Sales eXEcUTiVe,Married,NaN,No,Part Time,NaN,0
8,No,NaN,NaN,NaN,1,mANAGEr,Married,NaN,No,Full Time,NaN,True
9,No,travel_frequently,NaN,NaN,0,reSEaRCH DIrectoR,NaN,NaN,No,NaN,NaN,0

In [4]:
df_categoricos["roledepartament"].value_counts()

roledepartament
rESEArcH SCiEntIst  -  Research & Development            2
MaNAgeR  -  Sales                                        2
hEalthCaRe reprEseNTaTiVe  -  Research & Development     2
SaleS EXeCuTivE  -  Sales                                2
labORAtoRy tEcHNICIAN  -  Research & Development         2
                                                        ..
labORaTORY teChNIcIaN  -  Research & Development         1
saLES eXEcUTiVE  -  Sales                                1
mANUfacTURiNG dIRectOR  -  Research & Development        1
huMAn ResOurces  -  Human Resources                      1
sAleS EXECUtIvE  -  Sales                                1
Name: count, Length: 301, dtype: int64

In [5]:
df_categoricos["jobrole"].value_counts()

jobrole
mANager                    5
ManagEr                    3
mAnageR                    3
maNaGeR                    3
MANAgER                    3
                          ..
RESeaRCh sCientIsT         1
reseARCH sCIEntiST         1
REseaRCh SCiENTIst         1
LabOrATory TEChNICiaN      1
mAnUfactURInG DiRECTOr     1
Name: count, Length: 1579, dtype: int64

In [8]:
diccionario_gender={0: "M", 1: "F"}

In [9]:
df_categoricos["gender"]=df_categoricos["gender"].map(diccionario_gender)

In [10]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,Yes
1,No,NaN,NaN,Life Sciences,M,ManAGeR,NaN,NaN,NaN,NaN,NaN,1
2,No,travel_rarely,Research & Development,Technical Degree,M,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,1
3,No,travel_rarely,NaN,Medical,F,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,False
4,No,NaN,NaN,Technical Degree,F,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,0

In [11]:
df_categoricos["remotework"].value_counts()

remotework
1        375
True     362
False    318
0        318
Yes      305
Name: count, dtype: int64

In [12]:
df_categoricos['remotework'] = df_categoricos['remotework'].replace({'0': 'no', '1': 'yes', 'True': 'yes', 'False': 'no', 'Yes': 'yes'})

In [17]:
df_categoricos['businesstravel'].value_counts()

businesstravel
travel rarely        616
travel frequently    168
non travel            93
Name: count, dtype: int64

In [14]:
#quitar "-" y "_" de la columna businesstravel: 
df_categoricos["businesstravel"] = df_categoricos["businesstravel"].str.replace('_', ' ', regex=False).str.replace('-', ' ', regex=False)

In [15]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,resEArch DIREcToR,NaN,Y,No,Full Time,NaN,yes
1,No,NaN,NaN,Life Sciences,M,ManAGeR,NaN,NaN,NaN,NaN,NaN,yes
2,No,travel rarely,Research & Development,Technical Degree,M,ManaGER,Married,NaN,No,NaN,ManaGER - Research & Development,yes
3,No,travel rarely,NaN,Medical,F,ReseArCH DIrECtOr,Married,Y,NaN,Full Time,NaN,no
4,No,NaN,NaN,Technical Degree,F,sAleS EXECUtIve,Divorced,Y,No,NaN,NaN,no

In [45]:
df_categoricos['jobrole'] = df_categoricos['jobrole'].str.lower()

In [44]:
df_categoricos.head()

,attrition,businesstravel,department,educationfield,gender,jobrole,maritalstatus,over18,overtime,standardhours,roledepartament,remotework
0,No,NaN,NaN,NaN,M,research director,NaN,Y,No,Full Time,NaN,yes
1,No,NaN,NaN,Life Sciences,M,manager,NaN,NaN,NaN,NaN,NaN,yes
2,No,travel rarely,Research & Development,Technical Degree,M,manager,Married,NaN,No,NaN,ManaGER - Research & Development,yes
3,No,travel rarely,NaN,Medical,F,research director,Married,Y,NaN,Full Time,NaN,no
4,No,NaN,NaN,Technical Degree,F,sales executive,Divorced,Y,No,NaN,NaN,no

In [46]:

df_categoricos['maritalstatus'].value_counts()

maritalstatus
Married     419
Single      343
Divorced    194
Marreid      36
divorced     11
Name: count, dtype: int64

In [49]:
## Cambiamos 'lo que esta mal escrito en columna de marital status'
df_categoricos['maritalstatus'] = df_categoricos['maritalstatus'].map({
    'Married': 'Married',
    'divorced': 'Divorced',
    'Single': 'Single',
    'Divorced': 'Divorced'
})

In [50]:
df_categoricos['maritalstatus'].value_counts()

maritalstatus
Married     419
Single      343
Divorced    205
Name: count, dtype: int64